OpenDTEF-v1812/tutorials/incompressible/simpleFoam/turbulentFlatPlate/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.333333333333333;

vertices
(
    (-1 0 0.3)
    (0 0 0.3)
    (6 0 0.3)
    (6 3 0.3)
    (0 3 0.3)
    (-1 3 0.3)

    (-1 0 0)
    (0 0 0)
    (6 0 0)
    (6 3 0)
    (0 3 0)
    (-1 3 0)
);

blocks
(
//    //5  patch bottomWall y+ : min = 0.045097146, max = 0.13949865, average = 0.052922426
    hex (6 7 10 11 0 1 4 5) ( 96 385 1) simpleGrading (((1 9 0.15)(0.1 3 0.9)) 950 1)
    hex (7 8  9 10 1 2 3 4) (449 385 1) simpleGrading (((0.1 22 1.5)(0.35 23 7)(0.515 12 1)) 950 1)

// 3
//    hex (6 7 10 11 0 1 4 5) ( 24 97 1) simpleGrading (((1 9 0.15)(0.1 3 0.9)) 950 1)
//    hex (7 8  9 10 1 2 3 4) (113 97 1) simpleGrading (((0.1 22 1.5)(0.35 23 7)(0.515 12 1)) 950 1)

//-------------------------------------------------------------------
//
//    // 1 min = 0.60914299, max = 1.0197701, average = 0.71020364
//    hex (6 7 10 11 0 1 4 5) (6 25 1) simpleGrading (((1 9 0.15)(0.1 3 0.9)) 50000 1)
//    hex (7 8 9 10 1 2 3 4) (29 25 1) simpleGrading (((0.1 22 1.5)(0.35 23 7)(0.515 12 1)) 50000 1)
//
//    // 2
//    hex (6 7 10 11 0 1 4 5) (12 49 1) simpleGrading (((1 9 0.15)(0.1 3 0.9)) 50000 1)
//    hex (7 8  9 10 1 2 3 4) (57 49 1) simpleGrading (((0.1 22 1.5)(0.35 23 7)(0.515 12 1)) 50000 1)
//
//    // 3 patch bottomWall y+ : min = 0.18489745, max = 0.38018561, average = 0.21587743
//    hex (6 7 10 11 0 1 4 5) ( 24 97 1) simpleGrading (((1 9 0.15)(0.1 3 0.9)) 50000 1)
//    hex (7 8  9 10 1 2 3 4) (113 97 1) simpleGrading (((0.1 22 1.5)(0.35 23 7)(0.515 12 1)) 50000 1)
//
//    // 4
//    hex (6 7 10 11 0 1 4 5) ( 48 193 1) simpleGrading (((1 9 0.15)(0.1 3 0.9)) 50000 1)
//    hex (7 8  9 10 1 2 3 4) (225 193 1) simpleGrading (((0.1 22 1.5)(0.35 23 7)(0.515 12 1)) 50000 1)

//    //5  patch bottomWall y+ : min = 0.045097146, max = 0.13949865, average = 0.052922426
//    hex (6 7 10 11 0 1 4 5) ( 96 385 1) simpleGrading (((1 9 0.15)(0.1 3 0.9)) 50000 1)
//    hex (7 8  9 10 1 2 3 4) (449 385 1) simpleGrading (((0.1 22 1.5)(0.35 23 7)(0.515 12 1)) 50000 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (6 0 5 11)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (8 9 3 2)
        );
    }
    topWall
    {
        type wall;
        faces
        (
            (11 5 4 10)
            (10 4 3 9)
        );
    }
    bottomWall
    {
        type wall;
        faces
        (
            (7 8 2 1)
        );
    }
    symmetry
    {
        type symmetryPlane;
        faces
        (
            (6 7 1 0)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 1 4 5)
            (1 2 3 4)
            (6 11 10 7)
            (7 10 9 8)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
